ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/UC13_3_UART_1.0.xml
    <register id="UC13_3_UART_STAT" width="32" offset="0x1108" description="UART Status Register">
        <bitfield id="BUSY" description="UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The UART is not busy."/>
            <bitenum id="SET" value="0x1" description="The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register."/>
        </bitfield>
        <bitfield id="TXFF" description="UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is full."/>
        </bitfield>
        <bitfield id="RXFF" description="UART Receive FIFO Full" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="UART Transmit FIFO Empty" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="CTS" description="Clear To Send" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The CTS signal is not asserted (high)."/>
            <bitenum id="SET" value="0x1" description="The CTS signal is asserted (low)."/>
        </bitfield>
        <bitfield id="IDLE" description="IDLE mode has been detected in Idleline-Multiprocessor-Mode.
The IDLE bit is used as an address tag for each block of characters. In idle-line multiprocessor format, this bit is set when a received character is an address." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE has not been detected before last received character.
(In idle-line multiprocessor mode)."/>
            <bitenum id="SET" value="0x1" description="IDLE has been detected before last received character.
(In idle-line multiprocessor mode)."/>
        </bitfield>
        <bitfield id="RXFE" description="UART Receive FIFO Empty" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="eceive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="SENDIDLE" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="IDLE condition has not yet been sent on the line"/>
            <bitenum id="SET" value="0x1" description="IDLE condition has been sent on the line"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_IFLS" width="32" offset="0x110C" description="UART Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="RXTOSEL" description="UART Receive Interrupt Timeout Select. When receiving no start edge for an additional character within the set bittimes a RX interrupt is set even if the FIFO level is not reached. A value of 0 disables this function." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_IBRD" width="32" offset="0x1110" description="UART Integer Baud-Rate Divisor Register">
        <bitfield id="DIVINT" description="Integer Baud-Rate Divisor" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_FBRD" width="32" offset="0x1114" description="UART Fractional Baud-Rate Divisor Register">
        <bitfield id="DIVFRAC" description="Fractional Baud-Rate Divisor" begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_TXDATA" width="32" offset="0x1120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_RXDATA" width="32" offset="0x1124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FRMERR" description="UART Framing Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the FRMERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No framing error has occurred"/>
            <bitenum id="SET" value="0x1" description="The received character does not have a valid stop bit sequence, which is one or two stop bits depending on the UARTLCRH.STP2 setting (a valid stop bit is 1)."/>
        </bitfield>
        <bitfield id="PARERR" description="UART Parity Error   Writing to this bit has no effect. The flag is cleared by writing 1 to the PARERR bit in the UART EVENT ICLR register." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No parity error has occurred"/>
            <bitenum id="SET" value="0x1" description="The parity of the received data character does not match the parity defined by bits 2 and 7 of the UARTLCRH register."/>
        </bitfield>
        <bitfield id="BRKERR" description="UART Break Error  Writing to this bit has no effect. The flag is cleared by writing 1 to the BRKERR bit in the UART EVENT ICLR register. This error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No break condition has occurred"/>
            <bitenum id="SET" value="0x1" description="A break condition has been detected, indicating that the receive data input was held low for longer than a full-word transmission time (defined as start, data, parity, and stop bits)."/>
        </bitfield>
        <bitfield id="NERR" description="Noise Error.
Writing to this bit has no effect. The flag is cleared by writing 1 to the NERR bit in the UART EVENT ICLR register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="No noise error occurred"/>
            <bitenum id="SET" value="0x1" description="Noise error occurred during majority voting"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_AMASK" width="32" offset="0x1148" description="Self Address Mask Register">
        <bitfield id="MSK" description="Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC13_3_UART_ADDR" width="32" offset="0x114C" description="Self Address Register">
        <bitfield id="ADDR" description="Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>